m = size(data, 1);  % 记录数。
n = size(data, 2);  % 记录的特征数。 
% 数据平移-标准差化。
for i = 1:n
    temp = data(:,i);
    data(:,i) = (temp - mean(temp)) / std(temp);
end

Sigma = data' * data

% 按行和列对应数据。
C = data(:, 1); % 已评人数。
D = data(:, 2); % 班级规模。
E = data(:, 3); % 教学内容充实，注意推荐参考资料。
F = data(:, 4); % 关注学科专业发展，能用最新科研成果充实、更新教学内容。
G = data(:, 5); % 遵守教学纪律，按时上课，保证学时。
H = data(:, 6); % 采用的教学方法能有效地启发学生思维，强调相关学科的思想，引导学生探究。
I = data(:, 7); % 注意引导、激发学生对本课程的学习兴趣。
J = data(:, 8); % 通过本课程学习，掌握了知识，开阔了视野，比学习之初更热爱本课程，收获大。
K = data(:, 9); % 注意教学反馈，认真听取学生意见并加以改进。
L = data(:, 10); % 教学认真负责，对学生要求严格，耐心解答疑问。
M = data(:, 11); % 讲授娴熟，概念准确，条理清晰，重点突出，注意联系实际，引导学生学以致用。
N = data(:, 12); % 合理使用板书和多媒体教学手段，有助于学生理解和掌握知识。

% test data
test1 = (N(13) == 9.24)
test2 = (I(46) == 8.81)


